{"sections":{"467ca16e-bd17-4c4b-8542-003c25e4b7a6":{"type":"breadcrumbs","disabled":true,"settings":{"padding_top":20,"padding_bottom":20}},"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"rich_text_JUx3m9":{"type":"rich-text","blocks":{"heading_zHbgNp":{"type":"heading","settings":{"heading":"CONSIGNMENT TERMS","heading_size":"h2"}},"text_ajUBXX":{"type":"text","settings":{"text":"<p>Share information about your brand with your customers. Describe a product, make announcements, or welcome customers to your store.<\/p>"}},"text_TwYUUx":{"type":"text","settings":{"text":"<p><strong>1. Term <\/strong><\/p><p>This contract shall have a term of ninety (90) days. If you choose to take back your item(s) before the contract ends, you will be <strong>charged a $200 fee per item<\/strong>. Once the contract ends, you can take your item(s) back or leave them for longer, pending approval from RETYCHE. RETYCHE will determine to keep the items longer otherwise the client will be contacted to pick up their items within 10 days from date of contact. If items are not picked up within 10 days, RETYCHE releases all responsibility and they will be donated to charity.  For non-local consignment, items will be returned at a fee of $25 (in Canada).<\/p><p><strong>2. Pricing <\/strong><\/p><p>RETYCHE will work with Consignor to determine prices based on comparable current and historical prices of items in the same or similar style, condition and brand.<\/p><p>After the price of an item has been determined and agreed upon, it is subject to increase due to negotiation and fees (e.g. when sold via a third-party website or store). <\/p><p>All pricing will be in Canadian dollars. <\/p><p><strong>After 30 days, items will be discounted by 10%. After 60 days, items will be discounted by 20%. After 90 days the consignor has the option of (a) leaving your items with RETYCHE at a discount of 25% or (b) taking back your items. <\/strong><\/p><p>No discounts can be applied as per a case by case basis, only approved by RETYCHE<\/p><p><strong>3. Authenticity <\/strong><\/p><p>Consignor attests to the authenticity of all agreed-upon items. No pricing can be confirmed until an in person evaluation\/authentication is completed. If an item is deemed non-authentic, you will be charged a <strong>$250 fee<\/strong> to get your item back otherwise it will be destroyed. <strong>RETYCHE has the right to reject any item(s) if they are believed to be inauthentic. <\/strong><\/p><p><strong>4. Payment <\/strong><\/p><p>Consignors will be paid by cheque or e-transfer<strong> between the 15th-last day of the month of the following month after an item(s) is sold.<\/strong><\/p><p>It is the Consignor’s responsibility to contact RETYCHE once the 90-day period is up to terminate the contract and receive payouts. Any follow up is the consignor's responsibility.<\/p><p><strong>5. Ownership <\/strong><\/p><p>Consignor attests that they have legal title to and are in legal possession of all items that they have contracted RETYCHE to sell. <\/p><p><strong>6. Meeting of the Minds <\/strong><\/p><p>Both parties have read and understand all statements included in this contract. The contract may not be revised or amended without the written consent of both Consignor and RETYCHE<\/p><p><strong>7. Fees<\/strong><\/p><p>All buyouts will be listed at a set price on the contract where fees are negated. <\/p><p>Our consignment rates include our fees for credit card processing, photography, shipping and handling. <\/p><p>All firm\/set prices agreed upon for consignment, will be listed where fees are negated.<\/p><p>All RETYCHE listing prices can be increased to meet the minimum flat fee<\/p><p><span style=\"text-decoration:underline\"><strong>Consignment Rates & Fees<\/strong><\/span><\/p><p><strong>EXCEPTIONAL ITEMS (Chanel, Hermès, Fine Jewelry) - 70% - 90% back <\/strong><\/p><ul><li>Classic Chanel (last 10 years) <strong>75% - 85% back<\/strong><\/li><li>Hermès Quota Bags <strong>85% - 90% back<\/strong><\/li><li>Hermès Non-Quota Bags <strong>70% - 80% back<\/strong><\/li><li>Current Collection Styles of Select Brands <strong>70% - 80% back<\/strong><\/li><li>Fine Jewelry & Watches <strong>70% - 80% back<\/strong><\/li><\/ul><p><strong>ITEM PRICED between $1.00-$500 \/ 50% back <\/strong><\/p><ul><li>Minimum flat free of $100<\/li><li>The consignor will receive back 50% of the net selling price<\/li><\/ul><p><strong>ITEM PRICED between $500-$2500 \/ 60% back <\/strong><\/p><ul><li>The consignor will receive back 60% of the net selling price<\/li><\/ul><p><strong>ITEM PRICED between $2500-$5000 \/ 65% back <\/strong><\/p><ul><li>The consignor will receive back 65% of the net selling price<\/li><\/ul><p><strong>ITEM PRICED $5000+  \/ 70% back <\/strong><\/p><ul><li>The consignor will receive back 70% of the net selling price<\/li><\/ul><p><span style=\"text-decoration:underline\">What we accept:<\/span><\/p><p><span style=\"text-decoration:underline\"><strong>Shoes <\/strong><\/span><\/p><p>All shoes must be seasonal, in excellent condition with very few signs of wear. <\/p><ul><li>Shoes will be curated and determined by RETYCHE associates. <\/li><\/ul><p><span style=\"text-decoration:underline\"><strong>Accessories<\/strong><\/span><span style=\"text-decoration:underline\"> <\/span><\/p><p>Sunglasses, Wallets, Belts, Small Leather Goods & Accessories etc..<\/p><p><span style=\"text-decoration:underline\"><strong>Handbags<\/strong><\/span> <\/p><p>All high-end designer brands (Chanel, Hermes, Gucci, Louis Vuitton, Dior etc..)<\/p><p>Very Good\/Good Condition Handbags (Older, vintage styles)<\/p><p>Specific Models\/Styles & Brands<\/p><p>Exceptional Pieces, current styles <\/p><p>Select mid-contemporary brands (the Row, Mansur Gavriel, Khaite, Isabel Marant etc..)<\/p><p><\/p><p><span style=\"text-decoration:underline\"><strong>Clothing<\/strong><\/span><\/p><p>Clothing must be in excellent condition, dry cleaned with no damages<\/p><p>Clothing will be curated and determined by RETYCHE associate<\/p><p>Accepted Brands: High-end (Chanel, Louis Vuitton, Gucci, Saint Laurent, Versace, Dolce & Gabbana etc..)<\/p><p>Current (2010+) Contemporary Brands (Rick Owens, Acne, Ganni, Moncler, Jill Sander<\/p>"}},"text_grRJDm":{"type":"text","settings":{"text":"<p><a href=\"\/pages\/sell-with-us\" target=\"_blank\" title=\"SELL WITH US\">SELL WITH US<\/a><\/p>"}}},"block_order":["heading_zHbgNp","text_ajUBXX","text_TwYUUx","text_grRJDm"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":40,"padding_bottom":52}}},"order":["467ca16e-bd17-4c4b-8542-003c25e4b7a6","main","rich_text_JUx3m9"]}