{"sections":{"467ca16e-bd17-4c4b-8542-003c25e4b7a6":{"type":"breadcrumbs","disabled":true,"settings":{"padding_top":20,"padding_bottom":20}},"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"rich_text_nbQfEc":{"type":"rich-text","blocks":{"heading_6Vt8U6":{"type":"heading","disabled":true,"settings":{"heading":"LOCATION","heading_size":"h1"}},"text_eCRefi":{"type":"text","settings":{"text":"<h2>LOCATION & ACCESSIBILITY<\/h2><p>Our store is conveniently located in the heart of Montreal with easy access and free parking. Our team of experts is here to guide and advise you in your choices. We specialize in offering the finest pre-loved designer items, and our team of consignment experts is always available to help you with consignment and buyout services.<\/p><p>ROCKLAND CENTER | 2305 Rockland Rd, Mount Royal, Quebec H3P 3E9 Canada| (514) 797-9638<\/p><p><\/p><h2><\/h2><h2>OPENING HOURS<\/h2><p>MON | 10am - 6pm<\/p><p>TUE | 10am - 6pm<\/p><p>WED | 10am - 6pm<\/p><p>THU |  10am - 7pm<\/p><p>FRI |  10am - 7pm<\/p><p>SAT | 10am - 5pm<\/p><p>SUN | 10am - 5pm<\/p>"}},"text_jzrtEq":{"type":"text","settings":{"text":"<h2>PERSONALIZED SHOPPING OPTIONS<\/h2><p>We want to make sure that everyone can experience the joy of finding their perfect piece, whether you can come to our store or not. If you can't make it in, we're here for you! You can book an online appointment or facetime call, or send us a quick message on Instagram or email, and our team will be happy to help you with any questions or advice you need.<\/p><p><\/p><h2>IN STORES CONSIGNMENT <\/h2><p>If you're looking to consign your items, you can drop them off directly at our store. You will meet one of our consignment experts who will guide you through the process and answer any questions you may have. Alternatively, you can leave your items with us and we'll evaluate them based on their condition, brand, and market value. Our consignment program allows you to earn money on items you no longer use or need, and we make the process easy and convenient for you. Plus, we also offer buyout options on certain designer handbags, giving you the opportunity to receive payment upfront for your items.<\/p><h2>ONLINE CONSIGNMENT<\/h2><p> If you're looking to consign with us but aren't located in Montreal, please visit our consignment page for more information. We strive to provide a trustworthy and reliable service, ensuring that every transaction is handled with the utmost care and attention to detail.<\/p><p><a href=\"\/pages\/consign\" title=\"SELL WITH US\">GET A QUOTE<\/a><\/p><p><\/p>"}},"text_L8VjP3":{"type":"text","settings":{"text":"<h2>ORDER ONLINE<\/h2><p>At Retyche, we understand how important it is for you to receive your orders in a timely and convenient manner. That's why we offer free shipping on all orders over $500 within Canada. Our packages are discreetly shipped to protect your privacy, and we also offer easy return options if you're not completely satisfied with your purchase.<\/p><p>For those who prefer to shop online but still want the personalized touch of in-store shopping, our team is always available to answer any questions and provide guidance on your purchase. And if you're looking for a particular item that you don't see on our website, don't hesitate to reach out to us - we'll do our best to find it for you.<\/p><p>We take pride in making the shopping experience as easy and enjoyable as possible for our customers, whether you're shopping online or in-store. Thank you for choosing Retyche - we look forward to helping you find the perfect luxury item.<\/p><p><\/p><p><a href=\"\/collections\/all\" title=\"ALL\">SHOP NOW<\/a><\/p>"}}},"block_order":["heading_6Vt8U6","text_eCRefi","text_jzrtEq","text_L8VjP3"],"settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":12,"padding_bottom":52}}},"order":["467ca16e-bd17-4c4b-8542-003c25e4b7a6","main","rich_text_nbQfEc"]}